width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 4, ResNet, [128]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 8, ResNet, [256]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 12, ResNet, [512]]
 - [-1, 1, Conv, [1024, 3, 2]]
 - [-1, 8, ResNet, [1024]]

head:
 - [-1, 1, Classify, []]