width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [64, 7, 2]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]
 - [-1, 3, CSPResNet2C, [64]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 6, CSPResNet2C, [128]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 9, CSPResNet2C, [256]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 3, CSPResNet2C, [512]]

head:
 - [-1, 1, ClassifyR, []]