width_multiple: 0.5
depth_multiple: 0.0625

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 64, CSPResNet, [512]] # 9
 - [-1, 1, ConvTranspose, [256, 3, 2, "same"]]
 - [[-1, -4], 1, Concat, [-1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 8, Conv, [256, 3, 1]] # 14

head:
 - [[9, 14], 1, Classify, [0]]