width_multiple: 0.5
depth_multiple: 0.25

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 32, CSPResNet, [512]]

head:
 - [-1, 1, Classify, [0]]