width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 4, CSPResNet, [64]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 8, CSPResNet, [128]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 12, CSPResNet, [256]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 8, CSPResNet, [512]]

head:
 - [-1, 1, Classify, []]