width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 8, CSPResNet, [64]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 16, CSPResNet, [128]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 24, CSPResNet, [256]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 56, CSPResNet, [512]]
 - [-1, 1, Conv, [1024, 3, 2]]
 - [-1, 4, EEB, [1024, 128]]
 - [-1, 20, CSPResNet, [1024]]

head:
 - [-1, 1, Classify, []]