width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [32, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 2, ResNet, [32]]
 - [-3, 1, EEB, [32, 8]]
 - [[-1, -2], 1, Concat, [-1]]
 - [-1, 1, Conv, [64, 1, 1]]

 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 4, ResNet, [64]]
 - [-3, 1, EEB, [64, 16]]
 - [[-1, -2], 1, Concat, [-1]]
 - [-1, 1, Conv, [128, 1, 1]]

 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [128, 1, 1]]
 - [-1, 6, ResNet, [128]]
 - [-3, 1, EEB, [128, 32]]
 - [[-1, -2], 1, Concat, [-1]]
 - [-1, 1, Conv, [256, 1, 1]]

 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [256, 1, 1]]
 - [-1, 4, ResNet, [256]]
 - [-3, 1, EEB, [256, 64]]
 - [[-1, -2], 1, Concat, [-1]]
 - [-1, 1, Conv, [512, 1, 1]]

head:
 - [-1, 1, Classify, []]