width_multiple: 1.0
depth_multiple: 1.0

backbone:
 - [-1, 1, Conv, [32, 3, 1]]

 - [-1, 1, tf.keras.layers.MaxPooling2D, [3, 2, "same"]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]

 - [-1, 1, tf.keras.layers.MaxPooling2D, [3, 2, "same"]]
 - [-1, 1, Inception, [128]]
 - [-1, 1, Inception, [128]]

 - [-1, 1, tf.keras.layers.MaxPooling2D, [3, 2, "same"]]
 - [-1, 1, Inception, [256]]
 - [-1, 1, Inception, [256]]
 - [-1, 2, Inception, [256]]
 - [-1, 1, Inception, [256]]

 - [-1, 1, tf.keras.layers.MaxPooling2D, [3, 2, "same"]]
 - [-1, 1, Inception, [512]]
 - [-1, 1, Inception, [512]]

 - [-1, 1, tf.keras.layers.MaxPooling2D, [3, 2, "same"]]
 - [-1, 1, Conv, [1024, 3, 1]]
 - [-1, 1, Conv, [1024, 3, 1]]

head:
 - [-1, 1, ClassifyR, []]