width_multiple: 1.0
depth_multiple: 1.0
activation: tf.nn.relu

backbone:
 - [-1, 2, Conv, [64, 3, 1]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]
 - [-1, 2, Conv, [128, 3, 1]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]
 - [-1, 3, Conv, [256, 3, 1]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]
 - [-1, 3, Conv, [512, 3, 1]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]
 - [-1, 3, Conv, [1024, 3, 1]]
 - [-1, 1, tf.keras.layers.MaxPooling2D, [2, 2, "valid"]]

head:
 - [-1, 1, Classify, []]